#ЕКЗАМЕНАЦІЙНІ ЗАДАЧІ З ДИСКРЕТНОЇ МАТЕМАТИКИ (ДМ – 2019/20 (2 сем)) 

***Задачі з теорії графів***
7. Чи існує повний граф, у якого кількість ребер дорівнює (а) 15; (б) 18; (в) 199...900...0 (n дев’яток і n нулів); (г) 8k 2 + 2k, k є N?
23. Довести, що у будь-якому графі кількість вершин, степінь яких непарний, є парною.
34. Довести, що доповнення жодного кубічного графа не є кубічним графом.
41. Довести, що у будь-якому графі із n вершинами (n  2) завжди є принаймні дві вершини з однаковими степенями.
49. Визначити, чи існує граф із шістьма вершинами, степені яких дорівнюють (а) 2, 3, 3, 4, 4, 4; (б) 2, 2, 2, 4, 5, 5; (в) 1, 1, 2, 3, 4, 5; (г) 0, 1, 2, 3, 4, 4; (д) 1, 2, 3, 3, 4, 5.
9. Знайти по три пари неізоморфних графів G1 і G2, в яких (а) кількість вершин степеня k однакова для всіх k  0; (б) кількість простих циклів довжини l однакова для всіх l .
25. Довести, що кількість вершин будь-якого самодоповнювального графа дорівнює або 4k, або 4k + 1, k є N.
26. Довести, що довільний самодоповнювальний граф містить або 4k 2 – k, або 4k 2 + k ребер, k є N.
35. Скільки існує попарно неізоморфних графів, які мають (а) 6 вершин і 11 ребер; (г) 8 вершин, сума всіх степенів яких не менша від 53; (б) 7 вершин і 18 ребер; (д) 10 вершин і 43 ребра; (в) 8 вершин і 24 ребра; (е) n вершин і n(n – 1)/2 – 2 ребра? Відповідь обґрунтувати.
8. Спростувати таке твердження: якщо деякий ланцюг, що веде з вершини v у вершину w, проходить через вершину u (u  v і u  w), то цей ланцюг містить простий ланцюг, що веде з v у w і проходить через u.
10. Спростувати таке твердження: якщо в графі G для деяких трьох різних вершин v, w і u існують прості ланцюги, один із яких веде з v у w, а другий – із w в u, то в графі G є простий ланцюг, що веде з v в u і проходить через w.
11. Довести, що будь-який найкоротший ланцюг, що веде з вершини v у вершину w (v  w), є простим ланцюгом.
12. Довести, що довільний цикл містить простий цикл.
13. Довести, що коли два різні цикли графа G містять ребро e, тоді в графі G є цикл, серед ребер якого немає e.
18. Довести, що в графі, степені всіх вершин якого більші 1, є цикл.
22. Обґрунтувати, чому не існує зв’язного графа з вісьмома вершинами, степені яких дорівнюють 1, 1, 1, 2, 3, 4, 5, 7.
33. Довести, що граф є двочастковим тоді й тільки тоді, коли всі його цикли мають парну довжину.
40. Чи існує граф, у якому вилучення будь-якої вершини збільшує кількість компонент зв’язності? Відповідь обґрунтувати.
41. Чи існує граф, у якому вилучення будь-якого ребра збільшує кількість компонент зв’язності? Відповідь обґрунтувати.
45. Довести, що в зв’язному графі будь-які два прості ланцюги максимальної довжини мають принаймні одну спільну вершину. Чи правильно, що вони завжди мають спільне ребро?
50. Яку максимальну і яку мінімальну кількість вершин може мати зв’язний граф, в якому m ребер?
51. Довести, що зв’язний граф із n вершинами містить не менше ніж n – 1 ребро.
52. Довести, що коли в графі G з n вершинами кількість ребер більша ніж (n – 1)(n – 2)/2, тоді граф G зв’язний.
72. Довести, що діаметр графа G дорівнює 1 тоді й тільки тоді, коли граф G повний.
80. Довести, що для будь-якого графа G або він сам, або його доповнення G є зв’язним графом.
81. Довести, що коли граф G незв’язний, тоді граф G зв’язний і D(G )  2.
82. Нехай для діаметра зв’язного графа G виконується D(G)  3. Довести, що граф G є зв’язним і D(G )  3.
83. Довести, що самодоповнювальний граф є завжди зв’язним.
85. Довести, що діаметр D(G) довільного самодоповнювального графа G дорівнює або 2, або 3.
99. Нехай A – матриця суміжності графа G. Довести, що елемент aij (k) i-го рядка і j-го стовпчика матриці A k дорівнює кількості маршрутів довжини k, які ведуть у графі G із вершини з номером i у вершину з номером j.
100. Нехай A – матриця суміжності графа G. Довести, що (а) діагональний елемент aii (2) матриці A2 дорівнює степеню вершини графа G із номером i; (б) діагональний елемент aii (3) матриці A3 дорівнює подвоєній кількості трикутників графа G, які містять вершину з номером i. (в) сума всіх діагональних елементів aii (3) матриці A3 в шість разів перевищує кількість трикутників у графі G. 
3. Яку найбільшу та яку найменшу кількості розділювальних вершин може мати зв’язний граф з n вершинами?
4. Нехай v – вершина зв’язного графа G = (V, E). Довести, що такі твердження рівносильні: (1) v – розділювальна вершина графа G; (2) у графі G існують вершини u і w, відмінні від v, такі, що будь-який маршрут між u і w проходить через вершину v; (3) існує розбиття множини вершин V \{v} на підмножини V1 і V2 такі, що довільний шлях між будь-якими вершинами u є V1 і w є V2 проходить через вершину v; (4) у графі G існують такі суміжні з v вершини u і w, що будь-який маршрут між u і w проходить через вершину v.
5. Довести, що коли v – розділювальна вершина графа G, то v не є розділювальною вершиною в графі G .
6. Довести, що степені всіх вершин зв’язного графа G з n вершинами (n 3), який не має розділювальних вершин, більші 1.
7. Нехай G = (V, E) – зв’язний граф із n вершинами (n  3). Довести, що такі твердження рівносильні: (1) граф G не має розділювальних вершин; (2) будь-які дві вершини графа G належать деякому простому циклу; (3) будь-яка вершина та будь-яке ребро графа G належать деякому простому циклу; (4) будь-які два ребра графа G належать деякому простому циклу; (5) для будь-яких двох вершин v і w та будь-якого ребра e в графі G існує простий ланцюг, що веде з v у w і містить ребро e; (6) для будь-яких трьох вершин v, w та u в графі G існує простий ланцюг, що веде з v у w і проходить через вершину u.
9. Нехай e – ребро зв’язного графа G = (V, E). Довести, що такі твердження рівносильні: (1) e – міст графа G; (2) ребро e не належить жодному простому циклу графа G; (3) у графі G існують такі вершини v і w, що ребро e належить усім простим ланцюгам, які ведуть із v у w; (4) у графі G існують такі вершини v і w, що ребро e належить усім маршрутам, які ведуть із v у w; (5) якщо вершини v і w є кінцями ребра e, то v, e, w – це єдиний простий ланцюг, що з’єднує вершини v і w; (6) існує таке розбиття множини вершин V на підмножини V1 і V2, що для будь-яких вершин v є V1 і w є V2 ребро e належить довільному простому ланцюгу, що веде з v у w.
10. Яку найбільшу і яку найменшу кількості мостів може мати зв’язний граф G з n вершинами?
12. Нехай G = (V, E) – зв’язний граф із n вершинами (n  3). Довести, що такі твердження рівносильні: (1) граф G не має мостів; (2) будь-які дві вершини графа G належать деякому циклу; (3) будь-яка вершина та будь-яке ребро графа G належать деякому циклу; (4) будь-які два ребра графа G належать деякому циклу; (5) для будь-яких двох вершин v і w та будь-якого ребра e в графі G існує ланцюг, що веде з v у w і містить ребро e; (6) для будь-яких двох вершин v і w та будь-якого ребра e в графі G існує ланцюг, що веде з v у w і не містить ребра e; (7) для будь-яких трьох вершин v, w і u в графі G існує ланцюг, що веде з v у w і проходить через вершину u.
13. Довести, що граф, всі степені вершин якого парні, не має мостів.
20. Нехай G = (V, E) – зв’язний граф із n вершинами (n  3). Довести, що такі твердження рівносильні: (1) G – блок; (2) будь-які дві вершини графа G належать деякому спільному простому циклу; (3) будь-яка вершина та будь-яке ребро графа G належать деякому спільному простому циклу; (4) будь-які два ребра графа G належать деякому спільному простому циклу; (5) для будь-яких двох вершин v і w та будь-якого ребра e графа G існує простий ланцюг, що веде з v у w і містить ребро e; (6) для довільних трьох різних вершин у графі G існує простий ланцюг, який веде від однієї з цих вершин до іншої та проходить через третю вершину; (7) для довільних трьох різних вершин у графі G існує простий ланцюг, який веде від однієї з них до іншої і не проходить через третю вершину; (8) будь-які два ребра графа G, які мають спільну вершину, належать деякому простому циклу.
4. Навести приклад графа G з n вершинами і n – 1 ребром, який не є деревом. Чи може такий граф G бути зв’язним? Відповідь обґрунтувати.
5. Довести, що для довільного графа T = (V, E) з n вершинами (n  2) і m ребрами такі твердження є рівносильними: (1) T – дерево (ациклічний зв’язний граф); (2) T – зв’язний граф і m = n – 1; (3) T – ациклічний граф і m = n – 1; (4) для будь-яких вершин v і w в графі T існує тільки один простий ланцюг, що веде з v у w; (5) T – зв’язний граф, але після вилучення будь-якого ребра в ньому стає незв’язним; (6) T – ациклічний граф, але після проведення ребра між будь-якою парою несуміжних вершин v і w у графі з’являється один простий цикл; (7) T – зв’язний граф, відмінний від Kn, і після проведення ребра між будь-якою парою несуміжних вершин v і w у графі з’являється один простий цикл; (8) T – зв’язний граф і (T) = 0; (9) m = n – 1 і (T) = 0.
14. Довести, що коли граф G з n вершинами має більше ніж n – 1 ребро, тоді в графі G є принаймні один цикл.
15. Довести, що будь-яке дерево з n вершинами (n  2) має принаймні дві кінцеві вершини.
16. Довести, що дерево має тільки дві кінцеві вершини тоді й тільки тоді, коли воно є простим ланцюгом.
25. Яку найбільшу та яку найменшу кількості кінцевих вершин може мати дерево з n вершинами? Яку структуру мають відповідні дерева?
26. Описати всі дерева, доповнення яких також є деревами.
27. Описати всі дерева, які є самодоповнювальними графами.
28. Довести, що в дереві T кожне ребро є мостом.
32. Довести, що ліс, який має n вершин і складається з k дерев, містить n – k ребер.
44. Нехай задано граф G = (V, E), який має k компонент зв’язності. Довести, що для отримання його кістякового лісу з графа G необхідно вилучити (G) = |E | – |V | + k ребер ((G) – цикломатичне число графа).
49. Нехай (G) – цикломатичне число графа G. Довести, що (а) граф G є лісом тоді й тільки тоді, коли (G) = 0; (б) граф G має тільки один простий цикл тоді й тільки тоді, коли (G) = 1; (в) (G) = 1 тоді й тільки тоді, коли в графі G є ребро, після вилучення якого отримуємо ліс, кількість дерев у якому збігається з числом компонент зв’язності графа G; (г) кількість циклів у графі G не менша ніж (G).
9. Скільком граням може належати вершина степеня k плоского графа?
10. Довести, що для довільного плоского графа G = (V, E) виконується P rє  r = 2|E|.
11. Довести, що будь-яке дерево є планарним графом. Скільки граней має дерево?
13. Довести, що для будь-якого зв’язного плоского графа G = (V, E) виконується |V| – |E| + |P| = 2 (теорема Ейлера).
14. Довести теорему Ейлера для довільного плоского графа G = (V, E): |V| – |E| + |P| = k + 1, де k – кількість зв’язних компонент графа G.
15. Довести, що кількість граней будь-якої плоскої карти зв’язного планарного графа G з n вершинами і m ребрами є величиною сталою для графа G і дорівнює m – n + 2.
16. Довести, що кількість внутрішніх граней довільного плоского графа G дорівнює цикломатичному числу (G) графа G.
17. Довести, що для зв’язного планарного графа G з n вершинами (n  3) і m ребрами виконується нерівність m  3n – 6.
20. Визначити, чи існує планарний граф, що має: (а) 7 вершин і 16 ребер; (б) 8 вершин і 18 ребер; (в) 7 вершин і 15 ребер; (г) 8 вершин і 19 ребер.
21. Визначити, чи існує плоский граф, що має: (а) 6 вершин і 9 граней; (б) 8 вершин і 9 граней; (в) 7 вершин і 8 граней; (г) 7 вершин і 7 граней.
22. Яку найбільшу кількість граней може мати плоский граф із п’ятьма вершинами? Побудувати цей граф.
29. Довести, що повний граф із п’ятьма вершинами K5 не є планарним.
30. Довести, що повний двочастковий граф K3, 3 не є планарним.
45. Довести, що в зв’язному плоскому графі з n вершинами і m ребрами, степені всіх граней якого дорівнюють k, виконується рівність m(k – 2) = k(n – 2).
46. Довести, що коли у зв’язному плоскому графі з n вершинами і m ребрами довжини всіх простих циклів не менше k, тоді виконується нерівність m(k – 2)  k(n – 2).
47. Довести, що для зв’язного плоского графа з n вершинами (n  3) і m ребрами, який не містить трикутників, виконується m  2n–4.
55. Довести, що у будь-якому планарному графі є принаймні одна вершина, степінь якої не перевищує 5.
60. Довести, що граф з n вершинами (n  3) є максимальним плоским графом тоді й тільки тоді, коли він є тріангуляцією.
61. Довести, що будь-яка тріангуляція з n вершинами (n  3) містить 3n – 6 ребер і має 2n – 4 граней.
5. Визначити хроматичне число (а) повного графа Kn; (г) простого цикла довжини 2k; (б) повного двочасткового графа Kn, m; (д) простого цикла довжини 2k + 1, k є N; (в) довільного двочасткового графа; (е) дерева.
11. Довести, що хроматичне число нетривіального графа дорівнює 2 тоді й тільки тоді, коли він двочастковий.
13. Знайти графи, які мають різні хроматичні числа і в яких (а) кількість вершин степеня k однакова для всіх k  0; (б) кількість простих циклів довжини l однакова для всіх l .
19. Позначимо через (G) найбільший зі степенів вершин графа G. Довести, що для будь-якого графа G виконується нерівність (G)  1 + (G).
24. Довести, що вершини довільного планарного графа можна правильно розфарбувати не більше ніж у шість кольорів.
25. Довести, що для довільного планарного графа G виконується (G)  5.
27. Довести, що для правильного розфарбування довільного кубічного графа достатньо чотирьох фарб.
33. Довести, що будь-який повний граф є критичним.
35. Довести, що довільний критичний граф є зв’язним.
36. Довести, що критичний граф є блоком.
37. Знайти всі 2-критичні графи.
3. Довести, що зв’язний граф є ейлеровим тоді й тільки тоді, коли степені всіх його вершин парні.
9. Визначити, які з повних графів Kn є ейлеровими.
10. Для яких значень n і m повний двочастковий граф Kn, m є ейлеровим?
17. Довести, що зв’язний граф має ейлерів ланцюг тоді й тільки тоді, коли він має тільки дві вершини з непарними степенями.
26. Довести, що в повному графі Kn існує гамільтонів цикл для довільного n  3.
34. Довести, що у будь-якому гамільтоновому графі немає розділювальних вершин.
52. Навести приклади графа, який є ейлеровим, але не є гамільтоновим, а також гамільтонового графа, який не є ейлеровим.
10. Довести, що для довільного орграфа G = (V, E) справджується нерівність |E | ≤ |V|(|V| – 1).
110. Довести, що для довільного орграфа G = (V, E) виконується (а) v єV  +(v) = |E |; (б) v єV  +(v) = v єV  –(v).
12. Чи існує орграф із трьома вершинами, в якого півстепені виходу вершин дорівнюють 2, 2 і 0, а відповідні півстепені заходу – 2, 1 і 1?
19. Довести, що для будь-якої вершини v повного орграфа з n вершинами виконується рівність +(v) + –(v) = n – 1.
20. Довести, що у будь-якому повному орграфі є джерело.
21. Довести, що у будь-якому повному орграфі є стік.
22. Довести, що у повному орграфі є не більше однієї недосяжної вершини.
23. Довести, що у повному орграфі є не більше однієї тупикової вершини.
24. Довести, що для довільного повного орграфа з n вершинами v1, v2, ... , vn виконується рівність (а) n i 1   +(vi) = n(n – 1)/2; (б) n i 1   –(vi) = n(n – 1)/2; (в) n i 1   +(vi) = n i 1   (n – 1– +(vi)); (г) n i 1   (+(vi))2 = n i 1   (–(vi))2; (д) n i 1   (+(vi))2 = n i 1   (n – 1 – +(vi))2.
27. Довести, що у будь-якому повному орграфі існує простий ланцюг, який проходить через усі вершини орграфа.
49. Довести, що у сильно зв’язному орграфі кожна вершина є джерелом.
50. Довести, що у сильно зв’язному орграфі кожна вершина є стоком.
67. Довести, що в однобічно зв’язному орграфі може бути не більше однієї тупикової вершини.
68. Довести, що в однобічно зв’язному орграфі може бути не більше однієї недосяжної вершини.
69. Довести, що орграф G є однобічно зв’язним тоді й тільки тоді, коли в ньому є маршрут, що проходить через усі вершини орграфа G. 
***Задачі з теорії булевих функцій***
2. Знайти число двійкових векторів довжини n, (в) k координат яких є фіксованими; (д) серед сусідніх координат яких немає двох одиниць; (е) серед координат яких немає трьох послідовних нулів; (є) координати яких утворюють неспадну послідовність; (ж) у яких кількість одиничних координат не більша трьох; (з) у яких кількість нульових координат не перевищує кількості одиничних координат.
8. Знайти кількість двійкових векторів довжини n, вага яких (а) дорівнює k; (б) більша k; (в) є числом парним; (г) є числом непарним.
33. Для заданого двійкового вектора a є Bn визначити кількість двійкових векторів довжини n, (а) вага яких дорівнює ||a||; (д) більших вектора a; (б) вага яких менша ||a||; (е) непорівнюваних з вектором a; (в) сусідніх з вектором a; (є) порівнюваних з вектором a; (г) протилежних вектору a; (ж) відстань яких від a дорівнює k.
12. Визначити зі скількох елементів складається множина Nf для булевої функції f від n змінних, якщо f набуває (а) різні значення на протилежних наборах; (б) різні значення на сусідніх наборах; (в) значення 1 на тих і лише тих наборах, вага яких є парною; (г) значення 1 на тих і лише тих наборах, вага яких є непарною.
13. Довести, що кількість булевих функцій від n змінних дорівнює 2k, де k = 2n.
14. Визначити кількість булевих функцій f від n змінних, що задовольняють такі умови: (а) f набуває фіксоване значення на заданому наборі a є Bn; (б) f набуває фіксовані значення на заданих k наборах з Bn; (в) f набуває однакові значення на протилежних наборах; (г) f набуває різні значення на сусідніх наборах.
40. Скільки розв’язків має рівняння (а) x1 v x2 v ... v xn = 1; (б) x1 (+) x2 (+) ... (+) xn = 0; (в) x1 v x2 v ... v xn = x1x2...xn; (г) x1 (+) x2 (+) ... (+) xn = x1 v x2 v ... v xn; (д) x1 (+) x2 (+) ... (+) xn = x1x2...xn; (е) x1 (+) x2 (+) ... (+) xn (+) x1x2...xn = 1; (ж) x1-x2 v x2-x3 v x3-x4 v ... v xn – 1-xn v xn-x1 = 0; (з) (x1 v x2 v ... v xn) ^ (-(x1 ^ x2 ^ ... ^ xn)) = 1; (и) (x1 v -x2)(x2 v -x3)(x3 v -x4)...(xn – 1 v -xn)(xn v -x1) = 1.
41. Скільки розв’язків має система рівнянь: (а) x1 v x2 v ... v xn = 1, x1 (+) x2 (+) ... (+) xn = 1; (б) x1 v x2 v ... v xn = x1x2...xn, x1 (+) x2 (+) ... (+) xn (+) x1x2...xn = 1; (в) x1 v x2 v ... v xn = x1x2...xn, x1 (+) x2 (+) ... (+) xn = x1x2...xn.
44. Скільки розв’язків має нерівність: (а) x1 v x2 v ... v xn < x1x2...xn; (б) x1 (+) x2 (+) ... (+) xn < x1 v x2 v ... v xn; (в) x1 (+) x2 (+) ... (+) xn < x1x2...xn; (г) x1 (+) x2 (+) ... (+) xn (+) x1x2...xn < x1 v x2 v ... v xn; (д) 1 (+) x1 (+) x1x2 (+) x1x2x3 (+) ... (+) x1x2...xn < x1 v x2 v ... v xn.
19. На скількох наборах з Bn дорівнює 1 булева функція f(x1, x2, ..., xn), що задається поліномом Жегалкіна P(x1, x2, ..., xn): (а) P(x1, x2, ..., xn) = x1x2 (+) x1x3 (+) ... (+) x1xn, n  2; (б) P(x1, x2, ..., xn) = x1x2 (+) x3 (+) x4 (+) ... (+) xn, n  3; (в) P(x1, x2, ..., xn) = x1x2 (+) x1x3 (+) x4 (+) x5 (+) ... (+) xn, n  4; (г) P(x1, x2, ..., xn) = x1x2x3 (+) x4 (+) x5 (+) ... (+) xn, n > 4; (д) P(x1, x2, ..., xn) = x1x2...xk (+) xk + 1...xn, k = 1, 2, ..., n – 1; (е) P(x1, x2, ..., xn) = x1 (+) x1x2 (+) x1x2x3 (+) ... (+) x1x2...xn (+) 1, n  1; (є) P(x1, x2, ..., xn) = n i 1  (+)x1x2...xi – 1xi + 1...xn, n  2.
3. Довести, що клас T0 є замкненим.
4. Довести, що клас T1 є замкненим.
5. З’ясувати, при яких n функція f(x1, x2, ..., xn), що задається формулою A, належить класу T0 n T1, T1 \ T0, T0 \ T1 або T0  T1: (а) A = x1 (+) x2 (+) ... (+) xn (+) a, a є B; (б) A = x1x2 (+) x2x3 (+) ... (+) xn – 1xn (+) xnx1; (в) A = x1x2 (+) x1x3 (+) ... (+) x1xn (+) x2x3 (+) x2x4 (+) ... (+) xn – 1xn; (г) A = (x1 v x2) (+) (x1 v x3) (+) ... (+) (x1 v xn) (+) (x2 v x3) (+) (x2 v x4) (+) ... (+) (xn – 1 v xn); (д) A = 1 (+) (x1  x2)(x2  x3)(x3  x4)...(xn – 1  xn)(xn  x1).
3. Замінити у векторі a зірочки символами 0 і 1 так, щоб утворився вектор значень лінійної функції f. Зобразити f поліномом: (а) a = (10*1); (д) a = (1*101***); (з) a = (**10****0**0*110); (б) a = (0*11); (е) a = (*0*1**00); (и) a = (1**********0*110); (в) a = (100*0**0); (є) a = (1**11*0*); (і) a = (*11*1***1******0); (г) a = (*001**1*); (ж) a = (1**10*1*); (ї) a = (*******1*1**101*).
4. Довести, що клас L є замкненим.
11. Довести, що коли функція f(x1, x2, ..., xn) лінійна і відмінна від константи, то |Nf | = 2n – 1. Чи правильним є обернене твердження?
14. Знайти число лінійних функцій f(x1, x2, ..., xn) таких, що f(0, 0, ..., 0) = f(1, 1, ..., 1) = 1.
15. Визначити число булевих функцій, що залежать від n змінних і належать множині: (а) L; (е) T0  T1  L; (і) (T1 \ T0)  L; (м) P2 \ (T1  L); (б) T0  L; (є) T0 n T1 n L; (ї) L \ (T0  T1); (н) P2 \ (T0  L); (в) T1  L; (ж) L \ T1; (й) L \ (T0 n T1); (о) (T0 \ T1) n L; (г) T0 n L; (з) L \ T0; (к) (T1 \ T0) n L; (п) P2 \ (L \ T0); (д) T1 n L; (и) (T0 \ T1)  L; (л) P2 \ (T0 n L); (р) P2 \ (T1 \ L).
5. Довести, що клас C самодвоїстих булевих функцій є замкненим.
8. Довести, що коли f(x1, x2, ..., xn) є C, тоді |Nf | = 2n – 1. Навести приклад, що спростовує обернене твердження.
11. З’ясувати, коли булева функція, що задається формулою A , є самодвоїстою. (а) A = x1 (+) x2 (+) ... (+) xn (+) a, a є B; (б) A = x1x2 (+) x2x3 (+) ... (+) xn – 1xn (+) xnx1; (в) A = x1x2 (+) x1x3 (+) ... (+) x1xn (+) x2x3 (+) x2x4 (+) ... (+) xn – 1xn; (г) A = (x1 v x2) (+) (x2 v x3) (+) ... (+) (xn – 1 v xn) (+) (xn v x1); (д) A = (x1 v x2) (+) (x1 v x3) (+) ... (+) (x1 v xn) (+) (x2 v x3) (+) (x2 v x4) (+) ... (+) (xn – 1 v xn); (е) A = 1 (+) (x1  x2)(x2  x3)(x3  x4)...(xn – 1  xn)(xn  x1).
13. Довести, що лінійна функція є самодвоїстою тоді і тільки тоді, коли вона істотно залежить від непарного числа змінних.
20. Визначити число булевих функцій, що залежать від n змінних і належать множині: (а) (L n C) \ T1; (б) C \ (T0 n L). 1) T0  C; 15) T0 n T1 n C; 29) C  T0  L; 2) T1  C; 16) (L \ T0)  C; 30) (L \ (T0 n T1))  C; 3) T0 n C; 17) (C  T0) n T1; 31) C \ L; 4) T1 n C; 18) (C  L) \ T1; 32) L \ C; 5) T0  T1  C; 19) (T0 \ T1)  C; 33) (L \ C)  T1; 6) (T0 n T1)  C; 20) (C n L)  T1; 34) ((C \ L) \ T0) \ T1; 7) C \ T0; 21) (L \ C) n (T0 \ T1); 35) ((C  L) \ T0) \ T1; 8) C \ T1; 22) (C  L) \ T0; 36) C  (T1 \ L); 9) (L n T1)  C; 23) (C  L) \ (T0  T1); 37) (L  C) \ (T0T1); 10) L  T1  C; 24) (C  L) \ (T0 n T1); 38) (L  T0) \ (C  T1); 11) L n T0 n C; 25) (C \ T0)  T1; 39) (C  T1) \ T0; 12) (L n C) \ T1; 26) C \ (T0 n T1); 40) (T0  T1  L) n C; 13) (T0  T1  L) \ C; 27) (C  T0) \ T1; 41) (T0  T1  C) \ L; 14) (L \ T1)  C; 28) C \ (T0 n L); 42) T0 n T1 n C n L.
23. Довести, що: (а) T0  C = T1  C = T0  T1  C; (б) L  T0  C = L  T1  C = T0  T1  L = T0  T1  L  C.
29. Визначити число функцій, що залежать від змінних x1, x2, ..., xn і належать множині: (а) M \ (T0 n T1); (б) M \ (T0  T1); (в) M  L; (г) M  C  L; (д) L \ (M n C).
2. З’ясувати, чи є функціонально повною система  булевих функцій, що задаються своїми векторами значень: (а)  = {(0110), (01000011), (10010110)}; (б)  = {(0111), (11011010), (01101111)}; (в)  = {(0111), (10010110)}; (г)  = {(0101), (01101001), (01101011)}; (д)  = {(1001), (11101000)}; (е)  = {(11), (0111), (00110110)}; (и)  = {(10000001), (0110), (1001)}; (і)  = {(0010) , (01101001), (1100001100111100)}.
3. З’ясувати, чи є функціонально повною система  функцій, що задаються формулами:  = {-x, x(y ~ z) ~ yz, x (+) y (+) z}. (а)  = {x ^ y, x v y, x (+) y, xy v xz v yz}; (з)  = {x  y, x  (x ~ y), x (+) y (+) z, 1}; (б)  = {x ^ y, x v y, x (+) y (+) z (+) 1}; (и)  = {x  y, x (+) y}; (в)  = {0, -x, x(y (+) z) (+) yz}; (і)  = {(x ^ y) (+) z, (x ~ y) (+) z}; (г)  = {1, -x, x(y ~ z) (+) -x(y (+) z), x ~ y}; (ї)  = {x  y, -(x (+) y (+) z)}; (д)  = {-x, x(y ~ z) ~ (y v z), x (+) y (+) z}; (к)  = {xy (+) z, x (+) y (+) 1}; (е)  = {-x, x(y ~ z) ~ yz, x (+) y (+) z}; (л)  = {x  y, x  (-yz)}; (є)  = {xy(x (+) y), xy (+) x (+) y, 1, xy (+) xz (+) yz}; (м)  = {x ^ -y, -x ~ (yz)}.
13. Визначити, чи є система  функцій, що задаються формулами, базисом: (а)  = {x  y, x (+) y, x v y}; (ж)  = {xy (+) yz (+) zw, 0, 1, x v y}; (б)  = {x (+) y (+) z, x v y, 0, 1}; (з)  = {x (+) y (+) z, x (+) y, xy (+) xz (+) yz, x  y }; (в)  = {x (+) y (+) yz, x (+) y (+) 1}; (и)  = {x (+) y (+) z, xy (+) xz (+) yz, 0, 1}; (г)  = {xy v z, xy (+) z, xy ~ z}; (і)  = {x  y, x (+) y}; (д)  = {x  y, 0}; (ї)  = {x ~ y, x ^ y, 0}; (е)  = {x  y, -x}; (й)  = {x ~ y, x v y, 0}; (є)  = {x (+) y, x ~ yz}; (к)  = {-x ^ y, x ~ y, 1}.
14. З повної в P2 системи  виділити всі базиси: (а)  = {1, -x, xy(x (+) y), x (+) y (+) xy (+) xz (+) yz}; (д)  = {xy (+) z, x (+) y (+) 1, x-y, -x}; (б)  = {0, x (+) y, x  y, xy ~ xz}; (е)  = {x ^ y v -x ^ z, -x, x  y, 0, x (+) y ^ z}; (в)  = {0, 1, x (+) y (+) z, xy (+) xz (+) yz, xy (+) z, x v y}; (є)  = {x ^ y, x ^ y v z, x (+) y, x  y, -x}; (г)  = {x ^ y, x v y, xy v z, x (+) y, x  y}; (ж)  = {x (+) y, x ~ y, x (+) y (+) z, x ^ y, x  y}.
***Задачі з теорії автоматів***
3. Побудувати таблиці переходів і виходів, граф, матриці переходів і виходів автомата P, що функціонує у двійкових вхідному і вихідному алфавітах і за допомогою своїх станів запам’ятовує три останні символи (двійкові розряди), які було подано на його вхід. Вихідним сигналом є останній символ, що «забувається».
4. Побудувати таблиці переходів і виходів, граф, матриці переходів і виходів автомата A, на виході якого з’являється сигнал 1 тоді і лише тоді, коли на його вхід подано послідовність символів, що відповідає ідентифікатору якоїсь мови програмування. Вхідними сигналами автомата A є: x1 – літера, x2 – цифра, x3 – будь-який інший символ.
5. Побудувати таблиці переходів і виходів, граф, матриці переходів і виходів автомата A, на виході якого з’являється сигнал 1 тоді і лише тоді, коли на його вхід подано послідовність символів, що відповідає числовій константі – дійсному числу зі знаком і фіксованою точкою. Вхідними сигналами автомата A є: x1 – знак, x2 – цифра, x3 – точка, x4 – будь-який інший символ.
6. Побудувати автомат, що функціонує у двійкових вхідному і вихідному алфавітах і на виході якого з’являється сигнал 1 тоді і лише тоді, коли на його вхід подано послідовність, що не містить (а) однакових сусідніх сигналів; (б) двох сусідніх сигналів 1; (в) трьох сусідніх сигналів 1.
7. Побудувати автомат, що функціонує у двійкових вхідному і вихідному алфавітах і на виході якого з’являється сигнал 1 тоді і лише тоді, коли k останніх вхідних сигналів збігаються. (а) k = 2; (б) k = 4. Побудувати автомат, що функціонує у двійкових вхідному і вихідному алфавітах і на виході якого з’являється сигнал 1 тоді і лише тоді, коли 2 останні вхідні сигнали збігаються.
8. Побудувати автомат затримки, тобто автомат, вихідний сигнал якого в момент часу t + 1 дорівнює вхідному сигналу в момент часу t, X = Y = {0, 1}, y(0) = 0.
9. Побудувати автомат затримки на 2 такти, в якому вихідний сигнал в момент часу t + 2 збігається з вхідним сигналом у момент часу t, X = Y = {0, 1}, y(0) = y(1) = 0.
10. Побудувати автомат, що функціонує у двійкових вхідному і вихідному алфавітах і на виході якого з’являється сигнал 1 тоді і лише тоді, коли на його вхід подано двійкове число кратне k. (а) k = 2; (б) k = 4; (в) k = 8.
11. Побудувати автомат-«пошуковець», що функціонує у двійкових вхідному і вихідному алфавітах і на виході якого з’являється сигнал 1 тоді і лише тоді, коли останніми вхідними сигналами є (а) 0110; (б) 101010; (в) 11011; (г) 010010.
13. Побудувати «генератор парності», тобто автомат, що функціонує в алфавітах X = Y = {0, 1} і реалізує такий алгоритм. На його вхід надходять слова, в яких після кожних k символів стоїть 0. На виході автомат повинен повторити чергову групу з k символів, замінивши розділовий 0 на 1 тоді й лише тоді, коли кількість одиниць у цій групі парна. (а) k = 2; (б) k = 3; (в) k = 4.
17. Побудувати автомат, що здійснює контроль відповідності лівих і правих дужок у вхідному слові, яке задає певний алгебричний вираз. Вхідними сигналами автомата є: x1 – ліва дужка, x2 – права дужка, x3 – будь-який інший символ, x4 – символ, що позначає закінчення виразу.
18. Побудувати автомат, що керує роботою ліфта у чотириповерховому будинку. Станами автомата є номери поверхів. Вхідний сигнал – номер потрібного поверху, вихідний сигнал – напрямок руху (вгору, вниз, не рухатись).
1. Довести, що будь-яка скінченна множина слів P = {w1, w2, ..., wk} в алфавіті X – скінченна подія – є зображуваною в скінченному автоматі.
2. Побудувати автомат-розпізнавач, що зображує подію P. (а) P = {x1x1x1x2, x1x1x2x2x1, x1x1x1x1x2, x1x1x1x2x1x1}; (б) P = {e, x1x2x1x1x2x2, x1x1x2x1x1x2, x1x2x1x1}.
32. Побудувати автомат, що “відшуковує” у вхідному тексті (слові) певний фрагмент, тобто автомат, що переходить у заключний стан тоді й тільки тоді, коли вхідне слово в алфавіті X = {a, b} містить підслово w. (а) w = abbaaa; (б) w = baabab; (в) w = babaaab; (г) w = aabbaba.
33. Побудувати скінченний автомат для розпізнавання певної синтаксичної конструкції: (а) ідентифікатор; (б) число з фіксованою точкою; (в) ціла константа; (г) коментарі.
4. Визначити, чи належать події P слова v і w.
1. P = {00, 01}*, v = 00010, w = 100100; 6. P = {0}*{1}*{0}*, v = 0100110, w = 10110100;
2. P = {00}*{10}*, v = 010101, w = 1011000; 7. P = {00}*{1}*{0}, v = 001010, w = 10100100;
3. P = {000}*{1}*{0}, v = 0001110, w = 10100; 8. P = {010}{0}*{10}, v = 01010110, w = 10110100;
4. P = {00}{0}*{10}, v = 100110, w = 10001100; 9. P = {001, 11}*{0, 11}, v = 00010, w = 100100;
5. P = {00, 101}*{10, 11}, v = 0110010, w = 110010; 10. P = {0}*{011}{01}*, v = 0011010, w = 1001010.
6. Визначити, скільки слів події P* мають довжину k: (а) P = {aa, b}, k = 5; (б) P = {bb, a}, k = 7; (в) P = {ab, ba}, k = 7; (г) P = {ab, ba}, k = 8.
40. Написати регулярний вираз в алфавіті X = {0, 1}, який задає подію, що складається з усіх слів таких і тільки таких, в яких жодні дві 1 або жодні два 0 не стоять поруч. (а) довжини яких кратні 3; (і) які містять парну кількість 1; (б) в яких кількість символів 0 кратна 3; (ї) які містять парну кількість 0 і непарну кількість 1; (в) які містять рівно 3 символи 1; (к) в яких третім символом від кінця є 1; (г) які містять рівно 2 або рівно 3 символи 1; (л) в яких жодні дві 1 або жодні два 0 не стоять поруч; (д) які закінчуються на 00 або на 11; (н) в яких число нулів кратне 4; (е) які містять 00 або 11 тільки один раз; (с) в яких нулі утворюють підслова парної довжини; (є) які не містять підслово 111; (у) які утворюють двійкові числа, кратні 3; (и) які не містять 01; (ф) які складаються або тільки з нулів, або тільки з одиниць.
53. Описати словами подію, задану регулярним виразом (а) a(a n b)*; (б) (aa n ab n ba n bb)*; (в) ((a n b)a)*; (г) (a n b)*a(e n bbb)/
55. Довести або спростувати твердження про рівносильність регулярних виразів: (а) (a n b)* = a* n b*; (б) (ab n a)*a = a(ba n a)*; (в) (ab n a)*ab = (aa*b)*; (г) (a n b)*b = (a*b)*/
7. Побудувати автомат (діаграму переходів та таблицю переходів), що зображує подію, яка складається з тих і тільки тих слів в алфавіті {0, 1}, які (а) не містять підслово 1101010; (б) містять підслово 0100011.
6. Побудувати автомат (діаграму переходів та таблицю переходів), що розпізнає такі мови в алфавіті {0, 1}: (а) множину всіх слів, що закінчуються на 00; (б) множину всіх слів, що містять три нулі поспіль; (в) множину всіх слів, що містять 01011 як підслово; (г) множину всіх слів, в яких всі одиниці передують усім нулям; (д) множину всіх слів, в яких третім символом з кінця є 1; (е) множину всіх слів, що починаються або закінчуються символами 01; (и) множину всіх слів, які складаються або тільки з нулів, або тільки з одиниць; (і) множину всіх слів, які містять рівно 2 або рівно 3 символи 1; (ї) множину всіх слів, які не містять підслово 01; (й) множину всіх слів, які не містять підслово 111; (к) множину всіх слів, які містять не більше однієї пари послідовних одиниць. Теоретичні питання
1. Поняття графа. Способи задання графів
2. Зображення графів матрицями та списками суміжності
3. Підграфи. Різновиди графів
4. Степені вершин графа
5. Ізоморфізм графів
6. Операції для графів
7. Графи та бінарні відношення
8. Шлях (маршрут) у графі
9. Зв’язність графів. Перевірка зв’язності графів
10. Розділові вершини і мости
11. Відстань між вершинами
12. Ексцентриситет, радіус, діаметр і центр графа
13. Плоскі та планарні графи. Грань плоского графа, степінь грані
14. Теорема Ейлера про плоскі графи та її наслідки
15. Деякі важливі класи графів: дерево, ліс, двочастковий граф
16. Властивості дерев
17. Кістякове дерево (кістяк) графа. Побудова кістяка
18. Розфарбування графів. Хроматичне число.
19. Розфарбування планарних графів
20. Інваріанти ізоморфних графів
21. Обходи графів. Ейлерів граф. Теорема Ейлера
22. Гамільтонів граф
23. Орієнтовані графи. Теореми про орієнтовані графи
24. Граф як модель. Застосування теорії графів
25. Булеві функції. Елементарні булеві функції
26. Булеві функції і формули
27. Основні тотожності алгебри логіки
28. Розклад булевої функції за змінними
29. Канонічні форми булевих функцій (ДДНФ і ДКНФ)
30. Проблема повноти для систем булевих функцій
31. Алгебра Жегалкіна, поліном Жегалкіна
32. Замкнені класи булевих функцій.
33. Теорема про функціональну повноту
34. Поняття скінченного автомата
35. Методи задання автоматів
36. Автоматне відображення
37. Невідрізнюваність автоматів
38. Основні проблеми теорії автоматів
39. Зображення подій в автоматах
40. Регулярні вирази
41. Рівносильність регулярних виразів
42. Алгебра регулярних подій